[
    {
      "id": "video1",
      "title": "The key to Red Bull’s speed that F1 rivals missed",
      "shortDescription": "What makes the Red Bull RB19 so dominant?",
      "description": "What makes the Red Bull RB19 so dominant? Aerodynamics, right? Well, yes and no. It’s no secret that the Red Bull produces a huge amount of downforce – and remains aero efficient given it’s great straightline speed both with and without DRS, but something else is key to the grip level it produces. Not convinced? Well, last year in an interview with The Race’s Mark Hughes, Red Bull design legend Adrian Newey made the surprising revelation that his focus was the front and rear suspension. That’s a hint as to one key aspect that has made both last year’s and this year’s Red Bull so strong. And building on last year’s mechanical platform has helped Red Bull to make a bigger performance step this year than rivals thought possible",
      "videoUrl": "https://www.youtube.com/embed/ucFssS_-T9s"
    },
    {
      "id": "video2",
      "title": "What to expect from McLaren's first big upgrade of F1 2023",
      "shortDescription": "McLaren’s Formula 1 car finally gets a much anticipated upgrade at the Azerbaijan Grand Prix",
      "description": "McLaren’s Formula 1 car finally gets a much anticipated upgrade at the Azerbaijan Grand Prix as the team bids to fix its weaknesses and salvage its 2023 targets. But the MCL60’s first facelift is unlikely to completely transform its competitive prospects, having been at best a bang-average midfielder so far. That’s why, backed by the optimism of some major personnel changes behind the scenes, McLaren’s once again talking about future improvements - including another major upgrade package this year, that has been tentatively compared to bringing a B-spec car.",
      "videoUrl": "https://www.youtube.com/embed/XCWayuhZTrc"
    },
    {
      "id": "video3",
      "title": "Ford's F1 disaster",
      "shortDescription": "It is time to explain why the Blue Oval’s only foray into F1 team ownership was such a disaster",
      "description": "When Ford bought the race-winning Stewart Grand Prix team in June 1999 ahead of turning it into Jaguar for 2000, its ambition was to create the British Ferrari. But no amount of hype and British Racing Green paint could hide the fact that Ford’s ambitious plan failed dismally. In its five seasons in Formula 1, Jaguar never came close to winning a race. It finished on the podium just twice and never managed better than seventh in the constructors’ championship. Ford pulled out in late 2004, selling the team to Red Bull, which to add insult to injury soon turned this underachieving team into an F1 powerhouse. Ford is returning to F1 with Red Bull in 2026, so what better time to explain why the Blue Oval’s only foray into F1 team ownership was such a disaster?",
      "videoUrl": "https://www.youtube.com/embed/qpyWhUBLXug"
    }
  ]